benchmark/cherrypy.log
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        CherryPy/18.1.1
Server Hostname:        localhost
Server Port:            6161

Document Path:          /ratings
Document Length:        44077 bytes

Concurrency Level:      30
Time taken for tests:   48.227 seconds
Complete requests:      300
Failed requests:        0
Total transferred:      13271700 bytes
HTML transferred:       13223100 bytes
Requests per second:    6.22 [#/sec] (mean)
Time per request:       4822.684 [ms] (mean)
Time per request:       160.756 [ms] (mean, across all concurrent requests)
Transfer rate:          268.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       4
Processing:   530 4607 1685.7   4166   12749
Waiting:      530 4606 1685.7   4166   12749
Total:        534 4607 1685.5   4166   12749

Percentage of the requests served within a certain time (ms)
  50%   4166
  66%   4686
  75%   5250
  80%   5656
  90%   6878
  95%   8239
  98%   9364
  99%  10727
 100%  12749 (longest request)